<?php

namespace Database\Seeders;

use App\Models\Chapter;
use App\Models\Course;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class CourseSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $course = Course::create([
           "name" => "Основы кибербезопасности"
        ]);
        Chapter::create([
            "name" => "Введение",
            "markdown" => " ## Введение

Кибербезопасность - это практика защиты систем, сетей и программ от цифровых атак, которые направлены на доступ, изменение или уничтожение конфиденциальной информации, вымогательство денег у пользователей или нарушение нормальных бизнес-процессов.

С развитием технологий и все большей интеграцией интернета в повседневную жизнь, важность кибербезопасности растёт. В этом документе мы рассмотрим основные принципы и практики кибербезопасности.
            ",
            "course_id" => $course->id
        ]);
        Chapter::create([
            "name" => "Про основы",
            "markdown" => "## Основы кибербезопасности

### Что такое кибербезопасность?

Кибербезопасность относится к набору технологий, процессов и практик, разработанных для защиты сетей, устройств, программ и данных от атак, повреждений или несанкционированного доступа.

### Основные компоненты кибербезопасности

1. **Информационная безопасность**: Защита информации от несанкционированного доступа для обеспечения конфиденциальности, целостности и доступности данных.
2. **Операционная безопасность**: Процессы и решения для управления и защиты данных и активов, используемых в организациях.
3. **Компьютерная безопасность**: Безопасность устройств и серверов.
4. **Сетевая безопасность**: Защита целостности и безопасности данных в сети.

### Лучшие практики кибербезопасности

- **Регулярное обновление программного обеспечения**: Обновления часто содержат патчи для уязвимостей безопасности.
- **Использование сильных паролей и их регулярная смена**.
- **Обучение сотрудников**: Осведомленность о киберугрозах и способы их предотвращения.
- **Резервное копирование данных**: Регулярное создание резервных копий важных данных.
            ",
            "course_id" => $course->id
        ]);
        Chapter::create([
            "name" => "Заключение",
            "markdown" => "## Заключение

Кибербезопасность - это не единоразовая задача, а непрерывный процесс. Важно постоянно следить за новыми угрозами и адаптироваться к изменяющемуся ландшафту кибербезопасности. Помните, что безопасность начинается с вас!",
            "course_id" => $course->id
        ]);

    }
}
